In [1]:
import sys
print(sys.executable)
import os
print(os.chdir("..\\.."))
print(os.getcwd())

c:\Users\Admin\Projects\credit_risk_score\credit-risk-scoring\venv312\Scripts\python.exe
None
c:\Users\Admin\Projects\credit_risk_score\credit-risk-scoring

In [2]:
from src.data_loader import load_sample_data

df = load_sample_data()
df.head()

,loan_id,age,income,months_on_file,num_past_dues,days_past_due,credit_utilization,default
0,1,34.0,45000,24,0,0.0,0.12,0
1,2,45.0,60000,60,1,30.0,0.70,1
2,3,23.0,32000,6,0,NaN,0.10,0
3,4,51.0,80000,72,2,60.0,0.85,1
4,5,39.0,52000,36,0,15.0,0.30,0

In [3]:
df["credit_utilization"].map(type).value_counts()

credit_utilization
<class 'str'>      25
<class 'float'>     1
Name: count, dtype: int64

In [4]:
df[df["credit_utilization"].apply(lambda x: isinstance(x, str))]

,loan_id,age,income,months_on_file,num_past_dues,days_past_due,credit_utilization,default
0,1,34.0,45000,24,0,0.0,0.12,0
1,2,45.0,60000,60,1,30.0,0.70,1
2,3,23.0,32000,6,0,NaN,0.10,0
3,4,51.0,80000,72,2,60.0,0.85,1
4,5,39.0,52000,36,0,15.0,0.30,0
5,6,29.0,29000,12,1,10.0,0.55,0
6,7,41.0,75000,48,0,0.0,0.20,0
7,8,52.0,68000,84,3,90.0,0.92,1
8,9,27.0,33000,18,0,0.0,0.05,0
9,10,36.0,48000,30,1,20.0,0.40,0
10,11,NaN,50000,20,0,0.0,0.22,0
11,12,44.0,45k,40,1,25.0,0.60,1
12,13,19.0,15000,6,0,0.0,0.05,0
13,14,67.0,120000,120,4,120.0,0.95,1
14,15,31.0,NaN,14,0,0.0,0.18,0
15,16,55.0,90000,60,2,45.0,0.80,1
16,17,28.0,35000,10,0,NaN,0.08,0
17,18,22.0,20000,3,0,0.0,0.02,0
18,19,40.0,500000,240,5,365.0,0.99,1
19,20,33.0,48000,28,1,10.0,0.35,0
20,5,39.0,52000,36,0,15.0,0.30,0
22,22,38.0,52000,32,0,0.0,0.25,0
23,23,27.0,33000,18,0,0.0,0.05,0
24,24,45.0,50000,60,1,30.0,50%,1
25,25,100.0,1000000,12,0,0.0,0.01,0

In [5]:
print(os.getcwd())

c:\Users\Admin\Projects\credit_risk_score\credit-risk-scoring

In [6]:
df["loan_id"].value_counts()

loan_id
5     2
1     1
2     1
3     1
4     1
6     1
7     1
8     1
9     1
10    1
11    1
12    1
13    1
14    1
15    1
16    1
17    1
18    1
19    1
20    1
21    1
22    1
23    1
24    1
25    1
Name: count, dtype: int64

In [7]:
print(df[df["loan_id"]==5])

    loan_id   age income  months_on_file  num_past_dues  days_past_due  \
4         5  39.0  52000              36              0           15.0
20        5  39.0  52000              36              0           15.0

   credit_utilization  default
4                0.30        0
20               0.30        0

This dataset represents a small consumer credit portfolio with typical real-world data quality issues (missing values, sentinel values, mixed numeric formats, and identifier duplication). While cleaning is required, the data is not catastrophically corrupted and is suitable for exploratory modeling after proper preprocessing.

In [9]:
df.groupby("default")["age"].describe()

         count       mean        std   min    25%   50%    75%    max
default
0         17.0  35.058824  17.907647  19.0  27.00  31.0  38.00  100.0
1          8.0  49.875000   8.492644  40.0  44.75  48.0  52.75   67.0

In [10]:
import pandas as pd
pd.cut(df["age"], bins=[18,30,45,60,100]).groupby(df["default"]).count()

default
0    17
1     8
Name: age, dtype: int64

In [11]:
df.groupby("default")["income"].count()

default
0    17
1     8
Name: income, dtype: int64

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26 entries, 0 to 25
Data columns (total 8 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   loan_id             26 non-null     int64
 1   age                 25 non-null     float64
 2   income              25 non-null     object
 3   months_on_file      26 non-null     int64
 4   num_past_dues       26 non-null     int64
 5   days_past_due       24 non-null     float64
 6   credit_utilization  25 non-null     object
 7   default             26 non-null     int64
dtypes: float64(2), int64(4), object(2)
memory usage: 1.8+ KB

In [13]:
df.groupby("default")["months_on_file"].describe()

         count       mean        std   min   25%   50%   75%    max
default
0         18.0  19.555556  13.307328  -1.0  10.5  18.0  29.5   48.0
1          8.0  92.000000  64.285079  40.0  60.0  66.0  93.0  240.0

In [14]:
df.groupby("default")["num_past_dues"].describe()

         count      mean       std  min  25%  50%   75%  max
default
0         18.0  0.166667  0.383482  0.0  0.0  0.0  0.00  1.0
1          8.0  2.375000  1.505941  1.0  1.0  2.0  3.25  5.0

In [15]:
pd.crosstab(df["num_past_dues"], df["default"], normalize="index")

default          0    1
num_past_dues
0              1.0  0.0
1              0.5  0.5
2              0.0  1.0
3              0.0  1.0
4              0.0  1.0
5              0.0  1.0

In [16]:
df.groupby("default")["credit_utilization"].count()

default
0    17
1     8
Name: credit_utilization, dtype: int64

Age shows counter-intuitive behavior, with higher default among older borrowers; this may reflect portfolio composition or sample effects and requires caution.
Income and credit_utilization cannot be evaluated yet due to data type corruption.
Months_on_file exhibits non-intuitive behavior with higher default among longer-tenured borrowers, suggesting possible cohort or exposure effects.
num_past_dues shows a strong, monotonic, and intuitive relationship with default.

In [17]:
import pandas as pd
age_bins = pd.cut(df["age"], bins=[18,30,45,60,100])

pd.crosstab(age_bins, df["default"], normalize="index")

default           0         1
age
(18, 30]   1.000000  0.000000
(30, 45]   0.666667  0.333333
(45, 60]   0.000000  1.000000
(60, 100]  0.500000  0.500000

In [18]:
df_clean = df.copy()
print(df_clean.duplicated().sum())

1

In [19]:
df_clean.duplicated().sum()

np.int64(1)

In [20]:
df_clean = df_clean.drop_duplicates()

In [21]:
df_clean.shape

(25, 8)

In [22]:
import numpy as np

df_clean["months_on_file"] = df_clean["months_on_file"].replace(-1, np.nan)

In [23]:
df_clean["months_on_file"].isna().sum()

np.int64(1)

In [24]:
print(df_clean[df_clean["months_on_file"]==-1])

Empty DataFrame
Columns: [loan_id, age, income, months_on_file, num_past_dues, days_past_due, credit_utilization, default]
Index: []

In [25]:
df_clean["credit_utilization"].map(type).value_counts()

credit_utilization
<class 'str'>      24
<class 'float'>     1
Name: count, dtype: int64

In [26]:
df_clean["credit_utilization"] = (
    df_clean["credit_utilization"]
    .astype(str)
    .str.replace("%", "", regex=False)
)

df_clean["credit_utilization"] = pd.to_numeric(
    df_clean["credit_utilization"],
    errors="coerce"
)

In [27]:
df_clean.loc[df_clean["credit_utilization"] > 1, "credit_utilization"] /= 100

In [28]:
df_clean["credit_utilization"].describe()

count    24.000000
mean      0.385000
std       0.331741
min       0.010000
25%       0.095000
50%       0.275000
75%       0.625000
max       0.990000
Name: credit_utilization, dtype: float64

In [29]:
df_clean["income"] = (
    df_clean["income"]
    .astype(str)
    .str.lower()
    .str.replace(",", "", regex=False)
)

In [30]:
df_clean["income"] = pd.to_numeric(
    df_clean["income"],
    errors="coerce"
)

In [31]:
df_clean["income"].describe()

count         23.000000
mean      112260.869565
std       216168.540599
min        15000.000000
25%        34000.000000
50%        50000.000000
75%        71500.000000
max      1000000.000000
Name: income, dtype: float64

In [32]:
df_clean.info()

<class 'pandas.core.frame.DataFrame'>
Index: 25 entries, 0 to 25
Data columns (total 8 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   loan_id             25 non-null     int64
 1   age                 24 non-null     float64
 2   income              23 non-null     float64
 3   months_on_file      24 non-null     float64
 4   num_past_dues       25 non-null     int64
 5   days_past_due       23 non-null     float64
 6   credit_utilization  24 non-null     float64
 7   default             25 non-null     int64
dtypes: float64(5), int64(3)
memory usage: 1.8 KB

In [33]:
df_clean.isna().sum()

loan_id               0
age                   1
income                2
months_on_file        1
num_past_dues         0
days_past_due         2
credit_utilization    1
default               0
dtype: int64

In [34]:
df_clean.groupby("default")["age"].describe()

         count     mean        std   min    25%   50%    75%    max
default
0         16.0  34.8125  18.465170  19.0  27.00  30.5  36.50  100.0
1          8.0  49.8750   8.492644  40.0  44.75  48.0  52.75   67.0

In [35]:
age_bins = pd.cut(df_clean["age"], bins=[18,30,45,60,100])
pd.crosstab(age_bins, df_clean["default"], normalize="index")

default           0         1
age
(18, 30]   1.000000  0.000000
(30, 45]   0.636364  0.363636
(45, 60]   0.000000  1.000000
(60, 100]  0.500000  0.500000

In [36]:
df_clean["income"].describe()

count         23.000000
mean      112260.869565
std       216168.540599
min        15000.000000
25%        34000.000000
50%        50000.000000
75%        71500.000000
max      1000000.000000
Name: income, dtype: float64

In [37]:
df_clean.groupby("default")["income"].describe()

,count,mean,std,min,25%,50%,75%,max
default,,,,,,,,
0,16.0,100875.000000,240202.102405,15000.0,32750.0,46000.0,50500.0,1000000.0
1,7.0,138285.714286,161122.845769,50000.0,64000.0,80000.0,105000.0,500000.0

In [38]:
income_bins = pd.qcut(df_clean["income"], q=4, duplicates="drop")
pd.crosstab(income_bins, df_clean["default"], normalize="index")

default                      0         1
income
(14999.999, 34000.0]  1.000000  0.000000
(34000.0, 50000.0]    0.857143  0.142857
(50000.0, 71500.0]    0.500000  0.500000
(71500.0, 1000000.0]  0.333333  0.666667

In [39]:
df_clean.groupby("default")["months_on_file"].describe()

         count     mean        std   min   25%   50%   75%    max
default
0         16.0  19.8125  12.426953   3.0  11.5  18.0  28.5   48.0
1          8.0  92.0000  64.285079  40.0  60.0  66.0  93.0  240.0

In [40]:
months_bins = pd.cut(df_clean["months_on_file"], bins=[0,12,36,72,300])
pd.crosstab(months_bins, df_clean["default"], normalize="index")

default                0         1
months_on_file
(0, 12]         1.000000  0.000000
(12, 36]        1.000000  0.000000
(36, 72]        0.166667  0.833333
(72, 300]       0.000000  1.000000

In [41]:
df_clean.groupby("default")["num_past_dues"].describe()

         count      mean       std  min  25%  50%   75%  max
default
0         17.0  0.176471  0.392953  0.0  0.0  0.0  0.00  1.0
1          8.0  2.375000  1.505941  1.0  1.0  2.0  3.25  5.0

In [42]:
pd.crosstab(
    df_clean["num_past_dues"],
    df_clean["default"],
    normalize="index"
)

default          0    1
num_past_dues
0              1.0  0.0
1              0.5  0.5
2              0.0  1.0
3              0.0  1.0
4              0.0  1.0
5              0.0  1.0

In [43]:
df_clean.groupby("default")["credit_utilization"].describe()

         count      mean       std   min    25%    50%     75%   max
default
0         16.0  0.183125  0.155036  0.01  0.050  0.150  0.2625  0.55
1          8.0  0.788750  0.175046  0.50  0.675  0.825  0.9275  0.99

In [44]:
util_bins = pd.cut(df_clean["credit_utilization"], bins=[0,0.3,0.6,1.0])
pd.crosstab(util_bins, df_clean["default"], normalize="index")

default               0    1
credit_utilization
(0.0, 0.3]          1.0  0.0
(0.3, 0.6]          0.6  0.4
(0.6, 1.0]          0.0  1.0

- Age shows a non-monotonic, non-linear relationship with default risk, with elevated risk in middle-to-older age ranges. Signal is weak and unstable due to small sample size.
- Income shows a monotonic but counter-intuitive relationship with default in this sample, likely confounded by loan size or loan type. Signal should be interpreted cautiously.
- While individual exceptions exist, income shows a consistent monotonic trend across quantiles, indicating a robust directional signal.

In [45]:
df_clean["income_missing"] = df_clean["income"].isna().astype(int)

In [46]:
features = [
    "age",
    "income",
    "income_missing",
    "months_on_file",
    "num_past_dues",
    "credit_utilization",
]
target = "default"

In [47]:
X = df_clean[features]
y = df_clean[target]

In [48]:
X.isna().sum()

age                   1
income                2
income_missing        0
months_on_file        1
num_past_dues         0
credit_utilization    1
dtype: int64

In [49]:
X.info()
y.value_counts(normalize=True)

<class 'pandas.core.frame.DataFrame'>
Index: 25 entries, 0 to 25
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   age                 24 non-null     float64
 1   income              23 non-null     float64
 2   income_missing      25 non-null     int64
 3   months_on_file      24 non-null     float64
 4   num_past_dues       25 non-null     int64
 5   credit_utilization  24 non-null     float64
dtypes: float64(4), int64(2)
memory usage: 1.4 KB

default
0    0.68
1    0.32
Name: proportion, dtype: float64